steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static void clearOfflineRetryState() {
  prefs.begin("dashcfg", false);
  prefs.remove("offretry_attempt");
  prefs.remove("offretry_epoch");
  prefs.remove("offretry_next");
  prefs.end();
}

static time_t scheduleOfflineRecovery(
  time_t nowEpoch, int64_t serverRetryEpoch = 0, int64_t nextSlotEpoch = 0) {
  if (nowEpoch <= 0) return 0;
  uint8_t attempt = 0U;
  int64_t storedEpoch = 0;
  int64_t storedNextSlot = 0;
  loadOfflineRetryState(attempt, storedEpoch, storedNextSlot);
  if (serverRetryEpoch <= 0 && inktime::validOfflineRetryEpoch(
        static_cast<uint64_t>(nowEpoch), storedEpoch, storedNextSlot)) {
    return static_cast<time_t>(storedEpoch);
  }
  const inktime::OfflineRetryPlan plan = inktime::buildOfflineRetryPlan(
    static_cast<uint64_t>(nowEpoch), attempt, serverRetryEpoch, nextSlotEpoch);
  saveOfflineRetryState(
    plan.nextAttempt,
    static_cast<int64_t>(plan.sleepUntilEpoch),
    nextSlotEpoch > 0 ? nextSlotEpoch : 0);
  return static_cast<time_t>(plan.sleepUntilEpoch);
}
#endif

#if INKTIME_PHOTOPAINTER_ENABLED
// Preferences keys are kept under the ESP32 NVS key-size limit; these two
// bounded keys represent preview_schedule_id and preview_slot_index.
static int16_t loadPreviewCursorForSchedule(const String &scheduleId) {
  prefs.begin("dashcfg", true);
  const String storedScheduleId = prefs.getString("preview_sched", "");
  const int32_t storedIndex = prefs.getInt("preview_idx", -1);
  prefs.end();
  if (storedScheduleId != scheduleId) {
    prefs.begin("dashcfg", false);
    prefs.putString("preview_sched", scheduleId);
    prefs.putInt("preview_idx", -1);
    prefs.end();
    return -1;
  }
  return storedIndex < 0 || storedIndex > 127 ? -1 : static_cast<int16_t>(storedIndex);
}

static void savePreviewCursor(const String &scheduleId, int16_t slotIndex) {
  prefs.begin("dashcfg", false);
  prefs.putString("preview_sched", scheduleId);
  prefs.putInt("preview_idx", slotIndex);
  prefs.end();
}
#endif

#if INKTIME_PHOTOPAINTER_ENABLED
static bool loadLastPhotoIndex(size_t fileCount, size_t &indexOut) {
  if (fileCount == 0) return false;
  prefs.begin("dashcfg", true);
  const uint32_t value = prefs.getULong("photo_idx", UINT32_MAX);
  prefs.end();
  if (value == UINT32_MAX || value >= fileCount) return false;
  indexOut = static_cast<size_t>(value);
  return true;
}

static void saveLastPhotoIndex(size_t index) {
  prefs.begin("dashcfg", false);
  prefs.putULong("photo_idx", static_cast<uint32_t>(index));
  prefs.end();
}
#endif

static StoredDisplayRecord loadDisplayRecord() {
  prefs.begin("dashcfg", true);
  const uint8_t version = prefs.getUChar("disp_ver", 0);
  StoredDisplayRecord record = {
    prefs.getString("last_sha", ""),
    prefs.getString("last_rel", ""),
    prefs.getString("last_prof", ""),
    prefs.getString("last_board", ""),
    static_cast<int16_t>(prefs.getShort("last_rot", -1)),
    prefs.getBool("last_ok", false),
    false,
  };
  prefs.end();
  record.valid = version == 1U
    && inktime::isSha256HexValue(record.sha256.c_str())
    && record.releaseId.length() > 0U && record.releaseId.length() <= 128U
    && record.renderProfile.length() > 0U && record.renderProfile.length() <= 64U
    && record.boardProfile.length() > 0U && record.boardProfile.length() <= 96U
    && (record.rotation == 0 || record.rotation == 180);
  return record;
}

static void saveDisplayRecord(const Config &cfg, bool succeeded) {
  if (!inktime::isSha256HexValue(currentPayloadSha256.c_str())
      || currentReleaseId.length() == 0U || currentReleaseId.length() > 128U
      || currentRenderProfile.length() == 0U || currentRenderProfile.length() > 64U) {
    return;
  }
  prefs.begin("dashcfg", false);
  prefs.putUChar("disp_ver", 1U);
  prefs.putString("last_sha", currentPayloadSha256);
  prefs.putString("last_rel", currentReleaseId);
  prefs.putString("last_prof", currentRenderProfile);
  prefs.putString("last_board", kBoardConfig.name);
  prefs.putShort("last_rot", cfg.rotate180 ? 180 : 0);
  prefs.putBool("last_ok", succeeded);
  prefs.end();
}

static bool shouldSkipCurrentDisplay(const Config &cfg) {
  const StoredDisplayRecord stored = loadDisplayRecord();
#if INKTIME_PHOTOPAINTER_ENABLED
  const bool forcedRefresh = photoPainter.forceNetworkRefresh();
#else
  const bool forcedRefresh = false;
#endif
  const inktime::DisplayRecord record = {
    stored.sha256.c_str(),
    stored.releaseId.c_str(),
    stored.renderProfile.c_str(),
    stored.boardProfile.c_str(),
    stored.rotation,
    stored.succeeded,
    stored.valid,
  };
  const inktime::DisplayCandidate candidate = {
    currentPayloadSha256.c_str(),
    currentReleaseId.c_str(),
    currentRenderProfile.c_str(),
    kBoardConfig.name,
    static_cast<int16_t>(cfg.rotate180 ? 180 : 0),
    currentPayloadShaVerified,
    currentPayloadIntegrityTrusted,
    forcedRefresh,
    false,
    false,
  };
  return inktime::shouldSkipDisplay(record, candidate);
}

static bool validPendingQueueAck(PendingQueueAck &pending) {
  const uint8_t event = static_cast<uint8_t>(pending.event);
  pending.valid = inktime::boundedText(
      pending.queueItemId.c_str(), inktime::kQueueIdentifierMaxBytes)
    && pending.queueVersion >= 0
    && event <= static_cast<uint8_t>(inktime::QueueEvent::DisplayFailed)
    && pending.errorCode.length() <= 64U
    && pending.eventEpoch >= 0
    && (!pending.delayedTerminal || (
        (pending.event == inktime::QueueEvent::DisplayCompleted
          || pending.event == inktime::QueueEvent::DisplayFailed)
        && inktime::boundedText(pending.releaseId.c_str(), inktime::kQueueIdentifierMaxBytes)));
  return pending.valid;
}

static String ackJournalKey(char prefix, uint8_t index) {
  return String(prefix) + String(index);
}

static PendingQueueAck readAckJournalEntry(Preferences &journal, uint8_t index) {
  PendingQueueAck pending = {
    journal.getString(ackJournalKey('i', index).c_str(), ""),
    journal.getInt(ackJournalKey('v', index).c_str(), -1),
    static_cast<inktime::QueueEvent>(
      journal.getUChar(ackJournalKey('e', index).c_str(), 255U)),
    journal.getBool(ackJournalKey('s', index).c_str(), false),
    journal.getString(ackJournalKey('r', index).c_str(), ""),
    journal.getBool(ackJournalKey('d', index).c_str(), false),
    journal.getString(ackJournalKey('l', index).c_str(), ""),
    journal.getLong64(ackJournalKey('t', index).c_str(), 0),
    false,
  };
  validPendingQueueAck(pending);
  return pending;
}

static void writeAckJournalEntry(
  Preferences &journal,
  uint8_t index,
  const PendingQueueAck &pending
) {
  journal.putString(ackJournalKey('i', index).c_str(), pending.queueItemId);
  journal.putInt(ackJournalKey('v', index).c_str(), pending.queueVersion);
  journal.putUChar(
    ackJournalKey('e', index).c_str(), static_cast<uint8_t>(pending.event));
  journal.putBool(ackJournalKey('s', index).c_str(), pending.displaySkipped);
  journal.putString(ackJournalKey('r', index).c_str(), pending.errorCode);
  journal.putBool(ackJournalKey('d', index).c_str(), pending.delayedTerminal);
  journal.putString(ackJournalKey('l', index).c_str(), pending.releaseId);
  journal.putLong64(ackJournalKey('t', index).c_str(), pending.eventEpoch);
}

static bool samePendingQueueAck(
  const PendingQueueAck &left,
  const PendingQueueAck &right
) {
  return left.queueItemId == right.queueItemId
    && left.queueVersion == right.queueVersion
    && left.event == right.event;
}

static uint8_t ackJournalCount(Preferences &journal) {
  return min(
    journal.getUChar("count", 0U),
    static_cast<uint8_t>(inktime::kMaxAckJournalEntries));
}

static void removeLegacyPendingQueueAck() {
  prefs.begin("dashcfg", false);
  prefs.remove("ack_item");
  prefs.remove("ack_ver");
  prefs.remove("ack_event");
  prefs.remove("ack_skip");
  prefs.remove("ack_error");
  prefs.end();
}

static void persistPendingQueueAck(const PendingQueueAck &pending) {
  if (!pending.valid) return;
  Preferences journal;
  journal.begin("acklog", false);
  uint8_t count = ackJournalCount(journal);
  for (uint8_t index = 0; index < count; ++index) {
    const PendingQueueAck existing = readAckJournalEntry(journal, index);
    if (existing.valid && samePendingQueueAck(existing, pending)) {
      journal.end();
      return;
    }
  }
  uint8_t insertAt = count;
  if (count >= inktime::kMaxAckJournalEntries) {
    for (uint8_t index = 1; index < inktime::kMaxAckJournalEntries; ++index) {
      const PendingQueueAck shifted = readAckJournalEntry(journal, index);
      if (shifted.valid) writeAckJournalEntry(journal, index - 1U, shifted);
    }
    insertAt = inktime::kMaxAckJournalEntries - 1U;
  } else {
    ++count;
  }
  writeAckJournalEntry(journal, insertAt, pending);
  journal.putUChar("count", count);
  journal.end();
}

static void removePendingQueueAck(const PendingQueueAck &pending) {
  Preferences journal;
  journal.begin("acklog", false);
  const uint8_t count = ackJournalCount(journal);
  uint8_t found = count;
  for (uint8_t index = 0; index < count; ++index) {
    const PendingQueueAck existing = readAckJournalEntry(journal, index);
    if (existing.valid && samePendingQueueAck(existing, pending)) {
      found = index;
      break;
    }
  }
  if (found < count) {
    for (uint8_t index = found + 1U; index < count; ++index) {
      const PendingQueueAck shifted = readAckJournalEntry(journal, index);
      if (shifted.valid) writeAckJournalEntry(journal, index - 1U, shifted);
    }
    const uint8_t last = count - 1U;
    journal.remove(ackJournalKey('i', last).c_str());
    journal.remove(ackJournalKey('v', last).c_str());
    journal.remove(ackJournalKey('e', last).c_str());
    journal.remove(ackJournalKey('s', last).c_str());
    journal.remove(ackJournalKey('r', last).c_str());
    journal.remove(ackJournalKey('d', last).c_str());
    journal.remove(ackJournalKey('l', last).c_str());
    journal.remove(ackJournalKey('t', last).c_str());
    journal.putUChar("count", last);
  }
  journal.end();
}

static PendingQueueAck loadPendingQueueAck() {
  Preferences journal;
  journal.begin("acklog", true);
  const uint8_t count = ackJournalCount(journal);
  for (uint8_t index = 0; index < count; ++index) {
    PendingQueueAck pending = readAckJournalEntry(journal, index);
    if (pending.valid) {
      journal.end();
      return pending;
    }
  }
  journal.end();

  // Migrate the pre-journal single pending record without losing an event
  // after an upgrade from the previous firmware.
  prefs.begin("dashcfg", true);
  PendingQueueAck legacy = {
    prefs.getString("ack_item", ""),
    prefs.getInt("ack_ver", -1),
    static_cast<inktime::QueueEvent>(prefs.getUChar("ack_event", 255U)),
    prefs.getBool("ack_skip", false),
    prefs.getString("ack_error", ""),
    false,
    "",
    0,
    false,
  };
  prefs.end();
  if (validPendingQueueAck(legacy)) {
    persistPendingQueueAck(legacy);
    removeLegacyPendingQueueAck();
    return legacy;
  }
  return legacy;
}

static void clearPendingQueueAck() {
  const PendingQueueAck pending = loadPendingQueueAck();
  if (pending.valid) removePendingQueueAck(pending);
}

static uint32_t minutesToNextRefreshFromLastEpoch(const Config &cfg) {
  time_t lastEpoch;
  if (!loadLastTimeEpoch(lastEpoch)) {
    return 1440;
  }

