steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static bool performAutomaticPairing(Config &cfg) {
  if (!automaticPairingAllowed(cfg)) {
    return cfg.auth_state == "paired" && deviceCredential(cfg).length() > 0U && !deviceAuthInvalid;
  }
  String base;
  if (!normalizedBackendBase(cfg, base)) return false;

  if (cfg.auth_state == "credential_issued") {
    return confirmPairingCredential(cfg, base);
  }
  if (cfg.auth_state == "pairing_pending" && cfg.pairing_id.length() > 0U
      && cfg.pairing_nonce.length() > 0U) {
    return claimPairingCredential(cfg, base);
  }

  Config identityCandidate = cfg;
  if (identityCandidate.device_id.length() == 0U) {
    identityCandidate.device_id = String("esp32-") + randomPortalSecret();
    if (!savePairingCandidate(cfg, identityCandidate)) return false;
  }
  const String pairingNonce = cfg.pairing_nonce.length() > 0U
    ? cfg.pairing_nonce : randomPortalSecret();
  // Commit the nonce before the network request.  If the request reaches the
  // server but its response is lost during a power cut, the next wake can
  // repeat the same nonce and recover the original enrollment instead of
  // creating a second identity or getting stuck on a nonce conflict.
  Config requestCandidate = cfg;
  requestCandidate.auth_state = "pairing_pending";
  requestCandidate.pairing_id = "";
  requestCandidate.pairing_nonce = pairingNonce;
  requestCandidate.pairing_expires_at_epoch = 0U;
  requestCandidate.pairing_retry_at_epoch = 0U;
  if (!savePairingCandidate(cfg, requestCandidate)) return false;
  JsonDocument pairingRequest;
  pairingRequest["device_id"] = cfg.device_id;
  pairingRequest["pairing_nonce"] = pairingNonce;
  pairingRequest["firmware_identity"] = kBoardConfig.name;
  pairingRequest["firmware_version"] = INKTIME_FIRMWARE_VERSION;
  pairingRequest["panel_profile"] = INKTIME_PANEL_PROFILE;
  JsonObject capabilities = pairingRequest["capabilities"].to<JsonObject>();
  capabilities["automatic_pairing"] = true;
  capabilities["ab_credential_store"] = true;
  capabilities["stock_compatibility"] = true;
  capabilities["deep_sleep"] = true;
  String requestBody;
  serializeJson(pairingRequest, requestBody);

  inktime::DeviceHttpTransport requestTransport(cfg.ca_pem);
  HTTPClient requestHttp;
  String transportCode;
  String transportMessage;
  if (!requestTransport.begin(
        requestHttp, base + String(DEVICE_PAIRING_REQUEST_PATH), 15000,
        transportCode, transportMessage)) {
    (void)persistPairingRetry(cfg, "pairing_pending");
    lastDeviceErrorCode = transportCode.length() ? transportCode : "DEVICE-PAIRING-URL";
    lastDeviceErrorMessage = transportMessage.length() ? transportMessage : "配對 request URL 無法初始化";
    return false;
  }
  const char* pairingHeaders[] = {"Content-Type"};
  requestHttp.collectHeaders(pairingHeaders, 1);
  requestHttp.addHeader("Content-Type", "application/json");
  const int requestStatus = requestHttp.POST(requestBody);
  const int requestLength = requestHttp.getSize();
  const String requestContentType = requestHttp.header("Content-Type");
  if ((requestStatus != HTTP_CODE_CREATED && requestStatus != HTTP_CODE_OK)
      || requestLength <= 0 || requestLength > 8192
      || !requestContentType.startsWith("application/json")) {
    requestHttp.end();
    (void)persistPairingRetry(cfg, "pairing_pending");
    lastDeviceErrorCode = "DEVICE-PAIRING-REQUEST";
    lastDeviceErrorMessage = "配對 request HTTP／Content-Type／長度不合法";
    return false;
  }
  JsonDocument requestResponse;
  const DeserializationError requestJsonError = deserializeJson(requestResponse, requestHttp.getStream());
  requestHttp.end();
  const String pairingId = requestResponse["pairing_id"] | "";
  const String pairingCode = requestResponse["pairing_code"] | "";
  const String requestState = requestResponse["status"] | "pending";
  const bool requestReused = requestResponse["request_reused"] | false;
  const JsonVariantConst expiresValue = requestResponse["expires_in_seconds"];
  const JsonVariantConst serverEpochValue = requestResponse["server_epoch"];
  uint64_t serverEpoch = serverEpochValue.is<uint64_t>()
    ? serverEpochValue.as<uint64_t>() : pairingNowEpoch();
  if (serverEpoch < kPairingMinimumEpoch) serverEpoch = pairingNowEpoch();
  const bool validCode = pairingCode.length() == 6U
    && pairingCode[0] >= '0' && pairingCode[0] <= '9'
    && pairingCode[1] >= '0' && pairingCode[1] <= '9'
    && pairingCode[2] >= '0' && pairingCode[2] <= '9'
    && pairingCode[3] >= '0' && pairingCode[3] <= '9'
    && pairingCode[4] >= '0' && pairingCode[4] <= '9'
    && pairingCode[5] >= '0' && pairingCode[5] <= '9';
  const bool requestPending = requestState == "pending";
  const bool requestClaimable = requestState == "approved" || requestState == "credential_issued";
  if (requestJsonError || requestResponse.overflowed() || pairingId.length() == 0U
      || !expiresValue.is<int32_t>() || expiresValue.is<bool>()
      || expiresValue.as<int32_t>() < 1 || expiresValue.as<int32_t>() > 300
      || serverEpoch < kPairingMinimumEpoch
      || (!requestPending && !requestClaimable)
      || (requestPending && !validCode)
      || (requestReused && cfg.pairing_nonce != pairingNonce)) {
    (void)persistPairingRetry(cfg, "pairing_pending");
    lastDeviceErrorCode = "DEVICE-PAIRING-SCHEMA";
    lastDeviceErrorMessage = "配對 request 回應 schema 不合法；不建立新的裝置 credential";
    return false;
  }
  Config candidate = cfg;
  candidate.pairing_id = pairingId;
  candidate.pairing_nonce = requestReused ? cfg.pairing_nonce : pairingNonce;
  candidate.pairing_expires_at_epoch = serverEpoch + static_cast<uint64_t>(expiresValue.as<int32_t>());
  candidate.pairing_retry_at_epoch = 0U;
  candidate.pairing_retry_attempt = 0U;
  candidate.auth_state = "pairing_pending";
  if (!savePairingCandidate(cfg, candidate)) return false;
#if INKTIME_PHOTOPAINTER_ENABLED
  if (requestPending && validCode) {
    (void)photoPainter.displayPairingScreen(
      cfg.wifi_ssid.c_str(), "", base.c_str(), pairingCode.c_str());
  }
#else
  if (requestPending && validCode) (void)displayPairingCode(cfg, pairingCode);
#endif
  return claimPairingCredential(cfg, base);
}

static bool queueAckIdempotencyKey(const PendingQueueAck &pending, String &key) {
  char material[320];
  if (!inktime::idempotencyMaterial(
        pending.queueItemId.c_str(), pending.queueVersion, pending.event, material, sizeof(material))) {
    return false;
  }
  unsigned char digest[32];
  if (calculateSha256(
        reinterpret_cast<const unsigned char*>(material), strlen(material), digest) != 0) {
    return false;
  }
  char output[65];
  for (size_t index = 0; index < 32U; ++index) {
    snprintf(output + index * 2U, 3U, "%02x", digest[index]);
  }
  output[64] = '\0';
  key = output;
  return true;
}

static bool sendQueueAck(Config &cfg, const PendingQueueAck &pending, bool persistFirst) {
  if (!pending.valid) return false;
  if (persistFirst) persistPendingQueueAck(pending);
  String base;
  if (WiFi.status() != WL_CONNECTED || !normalizedBackendBase(cfg, base)) return false;
  String idempotencyKey;
  if (!queueAckIdempotencyKey(pending, idempotencyKey)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-KEY";
    lastDeviceErrorMessage = "Queue ACK idempotency key 無法建立";
    return false;
  }
  JsonDocument payload;
  payload["queue_item_id"] = pending.queueItemId;
  payload["queue_version"] = pending.queueVersion;
  payload["event"] = inktime::queueEventName(pending.event);
  payload["idempotency_key"] = idempotencyKey;
  if (pending.displaySkipped) {
    payload["display_skipped"] = true;
    payload["skip_reason"] = "same_sha256";
  }
  if (pending.delayedTerminal) {
    payload["ack_mode"] = "delayed_terminal";
    payload["release_id"] = pending.releaseId;
    if (pending.eventEpoch > 0) payload["event_epoch"] = pending.eventEpoch;
  }
  if (pending.errorCode.length() > 0U) payload["error_code"] = pending.errorCode;
  String body;
  serializeJson(payload, body);

  for (uint8_t attempt = 0; attempt <= inktime::kQueueRetryLimit; ++attempt) {
    inktime::DeviceHttpTransport transport(cfg.ca_pem);
    HTTPClient ackHttp;
    String transportCode;
    String transportMessage;
    if (!transport.begin(ackHttp, base + String(DEVICE_QUEUE_ACK_PATH), 15000, transportCode, transportMessage)) {
      lastDeviceErrorCode = transportCode;
      lastDeviceErrorMessage = transportMessage;
      break;
    }
    if (!addDeviceAuthorization(ackHttp, cfg)) {
      ackHttp.end();
      return false;
    }
    ackHttp.addHeader("Content-Type", "application/json");
    const int status = ackHttp.POST(body);
    const bool authFailed = handleDeviceAuthStatus(cfg, status);
    ackHttp.end();
    if (authFailed) return false;
    const inktime::AckDecision decision = inktime::ackDecision(status, attempt);
    if (decision == inktime::AckDecision::Accepted) {
      removePendingQueueAck(pending);
      return true;
    }
    if (decision == inktime::AckDecision::StaleManifest) {
      removePendingQueueAck(pending);
      lastDeviceErrorCode = "DEVICE-QUEUE-STALE";
      lastDeviceErrorMessage = "QUEUE-003 Queue version 已過期；下次重新取得 Manifest";
      return false;
    }
    if (decision == inktime::AckDecision::AuthorizationFailed) {
      lastDeviceErrorCode = "DEVICE-QUEUE-AUTH";
      lastDeviceErrorMessage = "Queue ACK Token／authorization 被拒絕";
      return false;
    }
    if (decision != inktime::AckDecision::Retry) break;
    delay(250U * (attempt + 1U));
  }
  lastDeviceErrorCode = "DEVICE-QUEUE-ACK-RETRY";
  lastDeviceErrorMessage = "Queue ACK 已達有界 retry 上限；pending event 已保留";
  return false;
}

static bool sendQueueEvent(
  Config &cfg,
  inktime::QueueEvent event,
  bool displaySkipped = false,
  const String &errorCode = String(""),
  bool delayedTerminal = false
) {
  const time_t eventNow = time(nullptr);
  PendingQueueAck pending = {
    currentQueueItemId,
    static_cast<int32_t>(currentQueueVersion),
    event,
    displaySkipped,
    errorCode.substring(0, 64),
    delayedTerminal,
    currentReleaseId,
    delayedTerminal && eventNow > 0 ? static_cast<int64_t>(eventNow) : 0,
    currentQueueItemId.length() > 0U && currentQueueVersion >= 0,
  };
  return sendQueueAck(cfg, pending, true);
}

