steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static bool promoteStagedNextIfDue(Config &cfg, time_t nowEpoch) {
  if (offlineScheduleTxnBlocked) {
    return failOfflineScheduleTransaction("離線排程 transaction 尚未完成 recovery");
  }
  if (nowEpoch <= 0) return false;
  String stagedJson;
  if (!photoPainter.readStagedNextSchedule(stagedJson)) return false;
  JsonDocument staged;
  if (deserializeJson(staged, stagedJson) || staged.overflowed()) return false;
  const String responseTarget = staged["target"] | "";
  const String deliveryMode = staged["delivery_mode"] | "";
  String targetDate = staged["target_local_date"] | "";
  if (targetDate.length() == 0U) targetDate = staged["target_date"] | "";
  const String legacyTargetDate = staged["target_date"] | "";
  const String scheduleId = staged["schedule_id"] | "";
  const String timezoneName = staged["timezone"] | "";
  const String panelProfile = staged["panel_profile"] | "";
  const String buttonWakeAction = staged["button_wake_action"] | "";
  const JsonVariantConst rawSchema = staged["schema_version"];
  const JsonVariantConst rawConfig = staged["config_version"];
  const JsonVariantConst rawRotation = staged["rotation"];
  const JsonVariantConst rawScheduleVersion = staged["offline_schedule_version"];
  const JsonVariantConst rawLead = staged["prefetch_lead_minutes"];
  const JsonVariantConst rawStart = staged["target_start_epoch"];
  const JsonVariantConst rawEnd = staged["target_end_epoch"];
  const JsonArrayConst rawSlots = staged["slots"].as<JsonArrayConst>();
  JsonArrayConst rawTimes = staged["schedule_times"].as<JsonArrayConst>();
  if (rawTimes.isNull()) rawTimes = staged["schedule"].as<JsonArrayConst>();

  String activeJson;
  JsonDocument active;
  if (!photoPainter.readActiveSchedule(activeJson)
      || deserializeJson(active, activeJson) || active.overflowed()) {
    return false;
  }
  String activeDate = active["target_local_date"] | "";
  if (activeDate.length() == 0U) activeDate = active["target_date"] | "";
  const JsonVariantConst activeEnd = active["target_end_epoch"];
  String expectedNextDate;
  const bool activeBoundaryValid = activeEnd.is<int64_t>() && !activeEnd.is<bool>()
    && activeEnd.as<int64_t>() > 0
    && nextIsoLocalDate(activeDate, expectedNextDate);
  const int64_t targetStartEpoch = rawStart.is<int64_t>() && !rawStart.is<bool>()
    ? rawStart.as<int64_t>() : 0;
  const int64_t targetEndEpoch = rawEnd.is<int64_t>() && !rawEnd.is<bool>()
    ? rawEnd.as<int64_t>() : 0;
  const int64_t activeTargetEndEpoch = activeBoundaryValid
    ? activeEnd.as<int64_t>() : 0;
  const uint32_t remoteConfigVersion = rawConfig.is<uint32_t>() && !rawConfig.is<bool>()
    ? rawConfig.as<uint32_t>() : 0;
  const int32_t remoteRotation = rawRotation.is<int32_t>() && !rawRotation.is<bool>()
    ? rawRotation.as<int32_t>() : -1;
  const int remoteLead = rawLead.is<int32_t>() && !rawLead.is<bool>()
    ? rawLead.as<int32_t>() : -1;
  if (responseTarget != "next" || deliveryMode != "inktime_offline_schedule"
      || !rawSchema.is<int32_t>() || rawSchema.is<bool>()
      || rawSchema.as<int32_t>() != inktime::kOfflineScheduleSchemaVersion
      || targetDate.length() != 10U
      || (legacyTargetDate.length() > 0U && legacyTargetDate != targetDate)
      || targetDate != expectedNextDate || timezoneName.length() == 0U
      || timezoneName.length() > 64U || !inktime::boundedText(scheduleId.c_str(), inktime::kQueueIdentifierMaxBytes)
      || panelProfile.length() == 0U
      || (panelProfile != "safe_4c" && panelProfile != String(INKTIME_PANEL_PROFILE))
      || !validButtonWakeAction(buttonWakeAction) || remoteLead < 0 || remoteLead > 120
      || targetStartEpoch <= 0 || targetEndEpoch <= targetStartEpoch
      || targetStartEpoch != activeTargetEndEpoch
      || remoteConfigVersion < cfg.config_version
      || (remoteRotation != 0 && remoteRotation != 180)
      || !rawScheduleVersion.is<int32_t>() || rawScheduleVersion.is<bool>()
      || rawScheduleVersion.as<int32_t>() < 0
      || rawSlots.isNull() || rawSlots.size() == 0U
      || rawSlots.size() > inktime::kMaxOfflineSlots
      || rawTimes.isNull() || rawTimes.size() != rawSlots.size()
      || !activeBoundaryValid || nowEpoch < targetStartEpoch || nowEpoch >= targetEndEpoch) {
    if (targetEndEpoch > 0 && nowEpoch >= targetEndEpoch) {
      (void)photoPainter.clearStagedNextSchedule();
    }
    return false;
  }

  inktime::OfflineSlot scheduleSlots[inktime::kMaxOfflineSlots] = {};
  for (size_t index = 0; index < rawTimes.size(); ++index) {
    if (!parseOfflineClock(rawTimes[index] | "", scheduleSlots[index])) return false;
  }
  if (!inktime::validateOfflineSlots(scheduleSlots, static_cast<uint8_t>(rawTimes.size()))) {
    return false;
  }
  inktime::OfflineNextScheduleContract contract = {
    rawSchema.as<int32_t>(),
    deliveryMode.c_str(),
    targetDate.c_str(),
    timezoneName.c_str(),
    targetStartEpoch,
    targetEndEpoch,
    activeTargetEndEpoch,
    targetStartEpoch - 1,
    remoteConfigVersion,
    cfg.config_version,
    remoteRotation,
    panelProfile.c_str(),
    INKTIME_PANEL_PROFILE,
    buttonWakeAction.c_str(),
    static_cast<uint8_t>(rawSlots.size()),
    static_cast<uint8_t>(rawTimes.size()),
    true,
    true,
    true,
    true,
  };
  int64_t previousShowAtEpoch = 0;
  for (size_t index = 0; index < rawSlots.size(); ++index) {
    const JsonVariantConst rawSlot = rawSlots[index];
    if (!rawSlot.is<JsonObjectConst>()) return false;
    const JsonObjectConst slot = rawSlot.as<JsonObjectConst>();
    const JsonVariantConst rawSize = slot["size"];
    const JsonVariantConst rawWidth = slot["width"];
    const JsonVariantConst rawHeight = slot["height"];
    const JsonVariantConst rawIndex = slot["slot_index"];
    const JsonVariantConst rawVersion = slot["queue_version"];
    const JsonVariantConst rawShowAt = slot["show_at_epoch"];
    const String itemId = slot["queue_item_id"] | "";
    const String releaseId = slot["release_id"] | "";
    const String slotScheduleId = slot["offline_schedule_id"] | "";
    const String sha = slot["sha256"] | "";
    const String downloadUrl = slot["download_url"] | "";
    const String pixelFormat = slot["pixel_format"] | "";
    const String renderProfile = slot["render_profile"] | "";
    const int64_t expectedSize = static_cast<int64_t>(FB_WIDTH) * FB_HEIGHT
      / (pixelFormat == "indexed4" ? 2 : 4);
    const bool identityValid = rawIndex.is<int32_t>() && !rawIndex.is<bool>()
      && rawIndex.as<int32_t>() == static_cast<int32_t>(index)
      && rawVersion.is<int32_t>() && !rawVersion.is<bool>() && rawVersion.as<int32_t>() >= 0
      && inktime::boundedText(itemId.c_str(), inktime::kQueueIdentifierMaxBytes)
      && inktime::boundedText(releaseId.c_str(), inktime::kQueueIdentifierMaxBytes)
      && inktime::boundedText(slotScheduleId.c_str(), inktime::kQueueIdentifierMaxBytes)
      && slotScheduleId == scheduleId
      && inktime::isSafeQueueDownloadPathForItem(
        downloadUrl.c_str(), downloadUrl.length(), itemId.c_str())
      && (renderProfile == "safe_4c" || renderProfile == String(INKTIME_PANEL_PROFILE));
    const bool payloadValid = rawSize.is<int64_t>() && !rawSize.is<bool>()
      && rawSize.as<int64_t>() == expectedSize
      && rawWidth.is<int32_t>() && !rawWidth.is<bool>() && rawWidth.as<int32_t>() == FB_WIDTH
      && rawHeight.is<int32_t>() && !rawHeight.is<bool>() && rawHeight.as<int32_t>() == FB_HEIGHT
      && (pixelFormat == "indexed4" || pixelFormat == "2bpp")
      && inktime::isSha256Hex(sha.c_str());
    const bool epochValid = rawShowAt.is<int64_t>() && !rawShowAt.is<bool>()
      && rawShowAt.as<int64_t>() >= targetStartEpoch
      && rawShowAt.as<int64_t>() < targetEndEpoch
      && (index == 0U || rawShowAt.as<int64_t>() > previousShowAtEpoch);
    contract.queueIdentityValid = contract.queueIdentityValid && identityValid;
    contract.sha256Valid = contract.sha256Valid && payloadValid;
    contract.slotEpochsValid = contract.slotEpochsValid && epochValid;
    if (epochValid) previousShowAtEpoch = rawShowAt.as<int64_t>();
  }
  if (!inktime::validOfflineNextScheduleContract(contract)) return false;
  Config candidate = cfg;
  candidate.schedule_count = static_cast<uint8_t>(rawTimes.size());
  for (uint8_t index = 0; index < candidate.schedule_count; ++index) {
    candidate.schedule_slots[index] = scheduleSlots[index];
  }
  candidate.refresh_hour = scheduleSlots[0].hour;
  candidate.refresh_minute = scheduleSlots[0].minute;
  candidate.rotate180 = remoteRotation == 180;
  candidate.prefetch_lead_minutes = static_cast<uint16_t>(remoteLead);
  candidate.delivery_mode = deliveryMode;
  candidate.button_wake_action = buttonWakeAction;
  candidate.config_version = remoteConfigVersion;
  String persistError;
  inktime::DeviceConfigStore::Prepared prepared;
  if (!configStore.prepare(configPayload(candidate), prepared, persistError)) {
    setConfigPersistenceError(persistError);
    return false;
  }
  inktime::configstore::RecoveryJournal journal;
  journal.phase = inktime::configstore::JournalPhase::Prepared;
  journal.target_schedule_id = scheduleId.c_str();
  journal.previous_active_slot = prepared.previous_active_slot;
  journal.previous_generation = prepared.previous_generation;
  journal.prepared_slot = prepared.prepared_slot;
  journal.prepared_generation = prepared.prepared_generation;
  if (!configStore.writeJournal(journal, persistError)) {
    setConfigPersistenceError(persistError);
    return false;
  }
  if (!photoPainter.promoteStagedNextSchedule()
      || photoPainter.activeScheduleId() != scheduleId) {
    return failOfflineScheduleTransaction("離線排程 staged next promote 或身分驗證失敗");
  }
  journal.phase = inktime::configstore::JournalPhase::SchedulePromoted;
  if (!configStore.writeJournal(journal, persistError)
      || !configStore.commit(prepared, persistError)) {
    return failOfflineScheduleTransaction("離線排程 midnight Config commit 失敗");
  }
  cfg = candidate;
  serverConfigChanged = true;
  offlineScheduleTxnBlocked = false;
  clearOfflineRetryState();
  return true;
}
#endif

#if INKTIME_PHOTOPAINTER_ENABLED
static bool loadOfflineScheduledLocalFrame(
  const Config &cfg, time_t nowEpoch, bool selectNext = false);
#endif

bool downloadDailyPhotoBin(Config &cfg) {
  currentPrefetchOnly = false;
  if (!resumePendingQueueAck(cfg)) return false;
#if INKTIME_PHOTOPAINTER_ENABLED
  const bool userButtonWake = photoPainter.wokeFromUserButton();
  const bool timerRequestedNetwork = enhancedNetworkWakeRequested;
  enhancedNetworkWakeRequested = false;
  if (offlineScheduleTxnBlocked && cfg.delivery_mode == "inktime_offline_schedule") {
    return failOfflineScheduleTransaction("離線排程 transaction 尚未完成 recovery");
  }
  if (cfg.delivery_mode == "inktime_offline_schedule") {
    if (userButtonWake && cfg.button_wake_action == "check_new") {
      // A button check may replace the active schedule, but a missing or
      // unavailable remote schedule must leave the cached formal day usable.
      (void)downloadOfflineScheduleAndFrames(cfg);
      currentPrefetchOnly = false;
      return loadOfflineScheduledLocalFrame(cfg, time(nullptr), false);
    }
    if (timerRequestedNetwork || offlinePrefetchWake(cfg, time(nullptr))) {
      const time_t wakeEpoch = time(nullptr);
      const bool formalSlotDue = activeHasDueFormalSlot(wakeEpoch);
      const bool stageTomorrow = offlineNextSchedulePrefetchDue(cfg, wakeEpoch)
        && !formalSlotDue;
      const bool displayAtThisWake = cfg.prefetch_lead_minutes == 0U || formalSlotDue;
      currentPrefetchOnly = stageTomorrow || !displayAtThisWake;
      const bool prefetched = downloadOfflineScheduleAndFrames(cfg, stageTomorrow);
      if (prefetched && displayAtThisWake && !stageTomorrow) {
        currentPrefetchOnly = false;
        return loadOfflineScheduledLocalFrame(cfg, time(nullptr), false);
      }
      return prefetched;
    }
    // Enhanced offline mode has no generic/latest-photo fallback.  Formal
    // frames are selected only from the active server-authored schedule.
    return false;
  }
#endif
  const QueueDownloadResult queueResult = downloadQueuePhotoBin(cfg);
  if (queueResult == QueueDownloadResult::Used) return true;
  if (queueResult == QueueDownloadResult::Failed) {
    if (currentFromQueue && !loadPendingQueueAck().valid) {
      sendQueueEvent(cfg, inktime::QueueEvent::DisplayFailed, false, lastDeviceErrorCode);
    }
    return false;
  }
  const bool latest = downloadLatestPhotoBin(cfg);
  if (latest) currentDisplaySkipped = shouldSkipCurrentDisplay(cfg);
  return latest;
}

